Repository: ivangalkindeveloper/Doglyad
Catalog: ios/Doglyad/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# aboutContactDescription
source: If you encounter any issues or problems, please contact us. Email:
ru: В случае обнаружения проблем или неполадок, пожалуйста, свяжитесь с нами. Email:

# aboutDescription
source: Doglyad is an AI assistant for generating medical reports of ultrasound examinations based on collected patient data.
ru: Догляд - ИИ-ассистент для генерации медицинских заключений ультра-звуковых исследований на основе собранных данных о пациенте.

# buttonAccept
source: Accept
ru: Принять

# buttonBack
source: Back
ru: Назад

# buttonCameraTurnOn
source: Turn on the camera
ru: Включить камеру

# buttonClear
source: Clear
ru: Очистить

# buttonClearAll
source: Clear all
ru: Очистить все

# buttonCollapse
source: Collapse
ru: Свернуть

# buttonExpand
source: Expand
ru: Раскрыть

# buttonNext
source: Next
ru: Далее

# buttonOpenSettings
source: Open settings
ru: В настройки

# buttonRepeatScan
source: Repeat scanning
ru: Повторить сканирование

# buttonSave
source: Save
ru: Сохранить

# buttonScan
source: Scan
ru: Сканировать

# buttonSelect
source: Select
ru: Выбрать

# buttonSelectType
source: Select type
ru: Выбрать тип

# buttonSpeech
source: Fill in by voice
ru: Заполнить голосом

# buttonStart
source: Let’s start!
ru: Давайте начнем!

# buttonUpdate
source: Update
ru: Обновить

# conclusionActualModelResponseTitle
source: Actual response
ru: Актуальный ответ

# conclusionModelResponseCopyMessageDescription
source: The model's response has been copied to the clipboard
ru: Ответ модели скопирован в буфер обмена

# conclusionModelResponseCopyMessageTitle
source: Response copied
ru: Ответ скопирован

# conclusionModelResponseLabel
source: Model response
ru: Ответ модели

# conclusionModelResponseUpdatedMessageDescription
source: The response from the neural model was successfully updated
ru: Ответ от нейронной модели был успешно обновлен

# conclusionModelResponseUpdatedMessageTitle
source: Response updated
ru: Ответ обновлен

# conclusionPreviosModelResponsesTitle
source: Previous responses
ru: Предыдущие ответы

# conclusionResponseDateLabel
source: Response date:
ru: Дата ответа:

# conclusionResponseModelLabel
source: Model:
ru: Модель:

# conclusionTitle
source: Conclusion
ru: Заключение

# errorNoCameraPermissionDescription
source: Please check camera permission for taking scan photos and try again
ru: Пожалуйста предоставьте разрешение доступа к камере для сбора фотографий для сканирования и попробуйте снова

# errorNoCameraPermissionTitle
source: Camera permission denied
ru: Отсутствует доступ к камере

# errorNoInternetConnectionDescription
source: Please check your internet connection and try again
ru: Пожалуйста проверьте подключение к интернету и попробуйте снова

# errorNoInternetConnectionTitle
source: No intenet connection
ru: Отсутствует интернет подключение

# errorUnknownDescription
source: An unknown error has occurred. Please try again later.
ru: Произошла неизвестная ошибка. Пожалуйста попробуйте позже.

# errorUnknownTitle
source: Unknown error
ru: Неизвестная ошибка

# historyEmptyDescription
source: The list of recent findings is empty. Please scan at least one study to view the responses history.
ru: Список последних заключений пуст. Пожалуйста, просканируйте хотя бы одно исследование чтобы смотреть историю запросов.

# historyTitle
source: History of research
ru: История исследований

# neuralModelResponseLengthDescription
source: Maximum number of characters in the model response. Leave empty for default length.
ru: Максимальное количество символов в ответе модели. Оставьте пустым для длины по умолчанию.

# neuralModelResponseLengthLabel
source: Response length
ru: Длина ответа

# neuralModelSettingsSavedSuccessMessageDescription
source: Neural model settings saved successfully
ru: Настройки нейронной модели успешно сохранены

# neuralModelSettingsSavedSuccessMessageTitle
source: Settings saved
ru: Настройки сохранены

# neuralModelTemplateDescription
source: The template is used by the neural model to generate a medical report. Example:
ru: Шаблон используется нейронной моделью для формирования медицинского заключения. Пример:

# neuralModelTemplateExampleDescription
source: Based on the ultrasound data provided: Organ(s) under examination: {{organ}} Position and contours: {{position_and_contours}} Dimensions: {{sizes}} Echostructure: {{echogenicity}} Focal lesions: {{lesions}} Conclusion: Ultrasound features: {{diagnostic_findings}}. Recommendations: {{recommendations}}
ru: На основании представленных данных УЗИ-исследования: Орган(ы) исследования: {{organ}} Положение и контуры: {{position_and_contours}} Размеры: {{sizes}} Эхоструктура: {{echogenicity}} Очаговые образования: {{lesions}} Заключение: УЗ-признаки {{diagnostic_findings}}. Рекомендации: {{recommendations}}

# neuralModelTemplateLabel
source: Response template
ru: Шаблон ответа

# neuralModelTemplatePlaceholder
source: Enter template...
ru: Введите шаблон...

# neuralModelTitle
source: Neural model
ru: Нейронная модель

# newVersionDescription0
source: A new version of the app is available. Please update application, to continue using service.
ru: Доступна новая версия приложения. Пожалуйста, обновите приложение, чтобы продолжить использовать сервис.

# newVersionDescription1
source: The new version contains improvements, critical bug fixes, and new features.
ru: Новая версия содержит улучшения, исправление кртичиных ошибок и новые удобства.

# newVersionTitle
source: New version
ru: Новая версия

# onBoardingDescriptionFifth
source: Next, scan the patient: take a photo of the ultrasound report, fill in the patient information, describe the study, and submit it to see the model's response.
ru: Далее сканируйте пациента: делайте фото ультра-звукового исследования, заполняйте данные пациента, описывайте проведенное исследования и отправляйте, чтобы увидеть ответ генерации модели.

# onBoardingDescriptionFirst
source: Doglyad - an AI assistant that generates ultrasound reports based on collected patient data. The report is generated by a specialized LLM model trained on large-scale medical research data.
ru: Догляд - это ИИ-ассистент, который генерирует заключение ультра-звукового исследования на основе собранных данных о пациенте. Заключение генерирует специальная LLM-модель, обученная на больших данных медицинских исследований.

# onBoardingDescriptionFourth
source: To get started, first select the ultrasound type.
ru: Для того чтобы начать работу сначала выберите тип ультразвукового исследования.

# onBoardingDescriptionSecond
source: The application is intended solely for use by qualified medical professionals and is not intended for use by patients or individuals without appropriate medical training.
ru: Приложение предназначено исключительно для использования квалифицированными медицинскими специалистами и не предназначено для использования пациентами или лицами без соответствующего медицинского образования.

# onBoardingDescriptionThird
source: The app uses artificial intelligence models to generate medical reports. The generated results are for informational and advisory purposes only. Please read and accept the app's terms of use.
ru: Приложение использует модели искусственного интеллекта для генерации медицинских заключений. Результаты генерации носят исключительно рекомендательный и вспомогательный характер. Пожалуйста ознакомьтесь и примите условия использования приложением.

# onBoardingLegalAcceptAndDescription
source: and
ru: и

# onBoardingLegalAcceptDescription
source: I accept
ru: Я принимаю

# onBoardingPrivacyPolicyLabel
source: Privacy Policy
ru: Политику конфиденциальности

# onBoardingTermsAndConditionsLabel
source: Terms & Conditions
ru: Условия и Положения

# onBoardingTitle
source: Welcome to Doglyad!
ru: Добро пожаловать в Догляд!

# permissionSpeechDescription
source: Grant the app permission to use the microphone to record your voice and recognize speech
ru: Предоставьте приложению разрешение на использование микрофона для записи вашего голоса и распознование речи

# permissionSpeechTitle
source: Microphone
ru: Микрофон

# privacyPolicyTitle
source: Privacy policy
ru: Политика конфиденциальности

# researchTypeAbdominalCavity
source: Abdominal cavity
ru: Брюшная полость

# researchTypeAbdominalVessels
source: Abdominal vessels
ru: Сосуды брюшной полости

# researchTypeArteriesOfTheLowerExtremities
source: Arteries of the lower extremities
ru: Артерии нижних конечностей

# researchTypeArteriesOfTheUpperExtremities
source: Arteries of the upper extremities
ru: Артерии верхних конечностей

# researchTypeBladder
source: Bladder
ru: Мочевой пузырь

# researchTypeBladderWithResidualUrineDetermination
source: Bladder with residual urine determination
ru: Мочевой пузырь с определением остаточной мочи

# researchTypeBrachiocephalicVessels
source: Brachiocephalic vessels
ru: Брахиоцефальные сосуды

# researchTypeEchocardiography
source: Echocardiography
ru: Эхокардиография

# researchTypeEye
source: Eye
ru: Глаз

# researchTypeFutureAddingDescription
source: We are already in the process of adding new research types, expect them in the next updates
ru: Мы уже в процессе добавления новых типов исследований, ожидайте их в ближайших обновлениях

# researchTypeHipJointsInNewborns
source: Hip joints in newborns
ru: Тазобедренные суставы у новорожденных

# researchTypeHollowOrgansStomachAndIntestines
source: Hollow organs (stomach and intestines)
ru: Полые органы (желудок и кишечник)

# researchTypeIntracanialArteries
source: Intracanial arteries
ru: Интраканиальные артерии

# researchTypeJoints
source: Joints
ru: Суставы

# researchTypeKidneysAdrenalGlandsAndRetroperitonealSpace
source: Kidneys, adrenal glands, and retroperitoneal space
ru: Почки, надпочечники и забрюшинное пространство

# researchTypeLymphNodes
source: Lymph nodes
ru: Лимфатические узлы

# researchTypeMammaryGlands
source: Mammary glands
ru: Молочные железы

# researchTypeNeurosonography
source: Neurosonography
ru: Нейросонография

# researchTypePelvicOrgans
source: Pelvic organs
ru: Органы малого таза

# researchTypePleuralRegion
source: Pleural region
ru: Плевральная область

# researchTypeRenalArteries
source: Renal arteries
ru: Почечные артерии

# researchTypeSalivaryGlands
source: Salivary glands
ru: Слюнные железы

# researchTypeScrotum
source: Scrotum
ru: Мошонка

# researchTypeSinuses
source: Sinuses
ru: Пазухи

# researchTypeSoftTissues
source: Soft tissues
ru: Мягкие ткани

# researchTypeThymusGland
source: Thymus gland
ru: Вилочковая железа

# researchTypeThyroidGland
source: Thyroid gland
ru: Щитовидная железа

# researchTypeTitle
source: Research type
ru: Тип исследования

# researchTypeVeinsOfTheLowerExtremities
source: Veins of the lower extremities
ru: Вены нижних конечностей

# researchTypeVeinsOfTheUpperExtremities
source: Veins of the upper extremities
ru: Вены верхних конечностей

# scanAdditionalDataLabel
source: Additional data
ru: Дополнительные данные

# scanAdditionalDataPlaceholder
source: The patient suffers from chronic diseases...
ru: Пациент страдает хроническими заболеваниями...

# scanCaptureDescription
source: Place the research image in a frame and take a photo of it for further scanning
ru: Поместите изображение исследования в рамку и сфотографируйте его для дальнейшего сканирования

# scanGenderFemaleLabel
source: Female
ru: Женщина

# scanGenderMaleLabel
source: Male
ru: Мужчина

# scanMaxPhotoDescription
source: Maximum number of photos: %(count)lld
ru: Максимальное количество фото: %(count)lld

# scanPatientComplaintLabel
source: Complaint
ru: Жалоба

# scanPatientComplaintPlaceholder
source: The patient complains of pain in the area...
ru: Пациент жалуется на боли в области...

# scanPatientDateOfBirthAgeLabel
source: years old
ru: лет

# scanPatientDateOfBirthLabel
source: Date of birth
ru: Дата рождения

# scanPatientDefaultNameLabel
source: Patient#%(count)lld
ru: Пациент#%(count)lld

# scanPatientGenderLabel
source: Gender
ru: Пол

# scanPatientHeightCMLabel
source: Height (cm)
ru: Рост (см)

# scanPatientNameLabel
source: Name
ru: Имя

# scanPatientNamePlaceholder
source: Patient#1
ru: Пациент#1

# scanPatientWeightKGLabel
source: Weight (kg)
ru: Вес (кг)

# scanResearchDateLabel
source: Research date
ru: Дата исследования

# scanResearchDescriptionLabel
source: Research description
ru: Описание исследования

# scanResearchDescriptionPlaceholder
source: The volume and shape of the objects under study, the state of curvature shows...
ru: Объем и форма исследуемых объектов, состояние кривизны показывает...

# scanTurnedOffCameraDescription
source: The camera is turned off to avoid wasting battery power
ru: Камера отключена чтобы не тратить заряд аккумулятора

# selectDateOfBirthTitle
source: Date of birth
ru: Дата рождения

# settingsAboutAppTitle
source: About the application
ru: О приложении

# settingsHistoryDescription
source: Conducted medical research: %(count)lld
ru: Проведено медицинских исследований: %(count)lld

# settingsHistoryEmptyDescription
source: No completed medical research yet
ru: Завершенных медицинских исследований пока нет

# settingsHistoryTitle
source: History of research
ru: История исследований

# settingsNeuralModelDescription
source: Settings for configuring the model's response for medical researchers
ru: Настройки для конфигурации ответа модели по медицинским исследованиям

# settingsNeuralModelTitle
source: Neural model
ru: Нейронная модель

# settingsPrivacyPolicyDescription
source: Collection, use, storage, and protection of users' personal data
ru: Сбор, использование, хранение и защиту персональных данных пользователей

# settingsPrivacyPolicyTitle
source: Privacy policy
ru: Политика конфиденциальности

# settingsStorageDescription
source: Storage management: conclusion history, model settings, and general application data
ru: Управление хранилищем: история заключений, настройки модели и общих данных приложения

# settingsStorageTitle
source: Storage
ru: Хранилище

# settingsTermsAndConditionsDescription
source: Terms and conditions of use of the application, rights, obligations of the parties and limitations of liability
ru: Условия и правила использования приложением, права, обязанности сторон и ограничения ответственности

# settingsTermsAndConditionsTitle
source: Terms & Conditions
ru: Условия и Положения

# settingsTitle
source: Settings
ru: Настройки

# speechProcessDescription
source: To fill out the form, click on the record button and dictate the data in the following form:
ru: Для заполнения формы нажмите на кнопку записи и продиктуйте голосом данные в следующей форме:

# speechProcessSpeechDescription
source: "Patient ... , date of birth ... , height ... centimeters, weight ... kilograms, complaints ... , examination performed: ... , additional information: ..."
ru: "Пациент ... , дата рождения ... , рост ... сантиметров, вес ... килограмм, жалобы ... , проведено исследование: ... , дополнительная информация: ..."

# speechTitle
source: Voice recording
ru: Запись голосом

# storageClearAllDescription
source: Delete all application data: conclusions, model settings, and general settings
ru: Удалить все данные приложения: заключения, настройки модели и общие настройки

# storageClearAllSuccessMessageDescription
source: All application data has been successfully deleted
ru: Все сохраненные данные приложения успешно удалены

# storageClearAllSuccessMessageTitle
source: Data deleted
ru: Данные удалены

# storageClearAllTitle
source: Clear all
ru: Очистить все

# storageClearAllWarningDescription
source: All app data will be permanently deleted: conclusion history, model settings, and general settings. This action cannot be undone. Are you sure?
ru: Все данные приложения будут безвозвратно удалены: история заключений, настройки модели и общие настройки. Это действие нельзя отменить, Вы уверены?

# storageClearAllWarningTitle
source: Clear all data
ru: Очистить все данные

# storageClearConclusionsDescription
source: Delete all saved research conclusions
ru: Удалить все сохранённые заключения исследований

# storageClearConclusionsSuccessMessageDescription
source: All conclusion history has been successfully deleted
ru: Вся история заключений успешно удалена

# storageClearConclusionsSuccessMessageTitle
source: History deleted
ru: История удалена

# storageClearConclusionsTitle
source: Remove conclusion history
ru: Удалить историю заключений

# storageClearConclusionsWarningDescription
source: All saved research reports will be permanently deleted. This action cannot be undone. Are you sure?
ru: Все сохранённые заключения исследований будут безвозвратно удалены. Это действие нельзя будет отменить, Вы уверены?

# storageClearConclusionsWarningTitle
source: Clear conclusion history
ru: Очистить историю заключений

# storageTitle
source: Storage
ru: Хранилище

# termsAndConditionsTitle
source: Terms & Conditions
ru: Условия и Положения
